import matplotlib.pyplot as plt
import scipy.fft as sp
import math

N = 128

samples = range(0,N-1)

filter = 10000

A = [1,5,3,7,3,2,1]
f = [0.5,1,2,5,7,9,12]
k = 7
pi = math.pi

f = [i*1000 for i in f]

fd = 4*max(f)
Td = 1/fd

# Пункт 1 /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
t = []
x = []

# Построение изначального сигнала сигнала по сэмплам
for n in samples:
    t.append(n * Td)
    x.append(0)
    for i in range(0,k):
        x[n] += A[i] * math.sin(2*pi*f[i]*t[n])

# Пункт 2 /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
        
fig, axs = plt.subplots(ncols=2,nrows=1,figsize=(16, 6))

axs[0].set_title("Дискретный сигнал по сэмплам")
axs[0].plot(list(samples), x, 'b')

axs[1].set_title("Дискретный сигнал по абсолютному времени")    
axs[1].plot(t, x, 'r')

plt.show()

# Пункт 3 /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# Построение ДПФ ОДПФ
dpfx = sp.fft(x)
odpfx = sp.ifft(dpfx)

# Пункт 4 /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
fig, axs = plt.subplots(ncols=2,nrows=1,figsize=(16, 6))

axs[0].set_title("ДПФ")
axs[0].plot(list(samples), dpfx, 'pink')

axs[1].set_title("ОДНФ")    
axs[1].plot(list(samples), odpfx, 'green')

plt.show()

# Пункт 5 /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# Уменьшенное количество сэмплов
N2 = N//2 

# Отбрасывание ненужной части спектра сигнала
dpfx_normal = dpfx[:N2]/(4096//4)

# Пункт 6 /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

fstep = fd/N
fn = [i*fstep for i in range(0,N2)]

fig, axs = plt.subplots(ncols=2,nrows=1,figsize=(16, 6))

axs[0].set_title("Нормализованный спектр исходного сигнала в абсолютных частотах ГЦ")
axs[0].plot(fn, dpfx_normal, 'teal')

axs[1].set_title("Нормализованный спектр исходного сигнала в сэмплах")
axs[1].plot(list(range(0,N2)), dpfx_normal, 'violet')

plt.show()

# Пункт 7 /////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////